TOKEN = '374411418:AAFLZOyh7eNisH0cYut1uwKry-af7t6At8I'  # Testing bot
# TOKEN = '471593255:AAGJCZombg3Tyr0MI8inMs7sioD_M1y1eq0'  # AnimalRacingBot
OWNER_ID = 137360484
LOGS_CHANNEL = -1001136199663
# CHANNEL_ID =  -1001141707367  # Animal races channel
# CHANNEL_ID = -1001128050160  # Animal races group
CHANNEL_ID = -1001055052315  #testing group
TRACKS_NUM = 8
RACE_LEN = 16
# SQLITE_DB_FILE = '/var/db/anti3z/races.sqlite'  # working DB
SQLITE_DB_FILE = '/var/db/anti3z/races.test' # testing db

RULES = '''Делайте ставки на зверушек на канале [Animal Races](https://t.me/animal_races) и выигрывайте `деньги` 💰.

Вы начинаете игру на 1⚜️ `уровне` с 1000💰 на счете.
Если Вы будете достаточно удачливы и хладнокровны, то при достижении определенной `суммы` 💰 на счете Вы перейдете на следующий `уровень` ⚜️.

При повышении `уровня` ⚜️ у Вас забираются все `деньги` 💰 и выдается новая стартовая `сумма` 💰(которая, тем выше, чем выше Ваш `уровень` ⚜).
При этом, для достижения следующего `уровня` ⚜️ Вам понадобится накопить уже б́ольшую сумму `денег` 💰.

Максимальная `сумма` 💰, которую Вы можете поставить в одном забеге, так же зависит от Вашего `уровня` ⚜️ и оставшихся на счете `денег` 💰.
Максимальная ставка составляет 10% от имеющейся у Вас суммы `денег` 💰, либо все ваши `деньги` 💰 за вычетом стартовой `суммы` 💰 выданной Вам в начале `уровня` ⚜️(из двух расчитаных значений выбирается большее).

Если удача постоянно обходила Вас стороной и у Вас на счете осталось меньше 1/10 от `суммы` 💰 выданной в начале `уровня` ⚜️, то распорядитель скачек даст Вам еще немножечко `денег` 💰, так что на Вашем счете вновь окажется `сумма` 💰 выдаваемая в начале `уровня` ⚜️.'''

# Для заработка дополнительных `денег` 💰, Вы можете поделиться ссылкой с приглашением в игру с Вашими друзьями и знакомыми. В этом случае Вы получите на Ваш счет `сумму` 💰  равную выдаваемой в начале Вашего текущего `уровня` ⚜️.'''
